tap "bbc/cd-utils"
tap "getantibody/tap"
tap "grammarly/tap"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "kieran-bamforth/repo"
tap "ouchxp/nodenv"
tap "wagoodman/dive"
cask "java"
cask "osxfuse"
# Slice and dice log files on the command-line
brew "angle-grinder"
# SSL/TLS cryptography library
brew "openssl"
# Library for command-line editing
brew "readline"
# Interpreted, interactive, object-oriented programming language
brew "python", link: false
# Automate deployment, configuration, and upgrading
brew "ansible"
# Java build tool
brew "ant"
# Record and share terminal sessions
brew "asciinema"
# Integrated shell for working with the AWS CLI
brew "aws-shell"
# Official Amazon AWS command-line interface
brew "awscli"
# Simple command-line tool to read AWS CloudWatch logs
brew "awslogs"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Portable Foreign Function Interface library
brew "libffi"
# Statistics utility to count lines of code
brew "cloc"
# Cross-platform make
brew "cmake"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Reimplementation of ctags(1)
brew "ctags"
# Good-lookin' diffs with diff-highlight and more
brew "diff-so-fancy"
# Library and command-line tool for SSH
brew "fabric"
# CLI tool for quick access to files and directories
brew "fasd"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Command-line outline and bitmap font editor/converter
brew "fontforge"
# Monitor a directory for changes and run a shell command
brew "fswatch"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU awk utility
brew "gawk"
# Git extension for versioning large files
brew "git-lfs"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Simple jira command-line client in Go
brew "go-jira"
# Image processing tools collection
brew "graphicsmagick"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# Make JSON greppable
brew "gron"
# Improved top (interactive process viewer)
brew "htop"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Add GitHub support to git on the command-line
brew "hub"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Manage your Java environment
brew "jenv"
# Json incremental digger
brew "jid"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Rainbows and unicorns in your console!
brew "lolcat"
# Create a graph of dependencies from GNU-Make
brew "makefile2graph"
# Mac App Store command-line interface
brew "mas"
# Java-based project management
brew "maven"
# CLI for MySQL with auto-completion and syntax highlighting
brew "mycli"
# Platform built on V8 to build network applications
brew "node"
# Install NodeJS versions
brew "node-build"
# Manage multiple NodeJS versions
brew "nodenv"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Python dependency management tool
brew "pipenv"
# Draw UML diagrams
brew "plantuml"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Wrapper to colorize and simplify ping's output
brew "prettyping"
# Collection of PostScript document handling utilities
brew "psutils"
# Python version management
brew "pyenv"
# Pyenv plugin to manage virtualenv
brew "pyenv-virtualenv", args: ["HEAD"]
# Messaging broker
brew "rabbitmq"
# Ruby version manager
brew "rbenv"
# Reattach process (e.g., tmux) to background
brew "reattach-to-user-namespace"
# Persistent key-value database, with built-in net interface
brew "redis"
# Standard unix software packaging tool
brew "rpm"
# Powerful, clean, object-oriented scripting language
brew "ruby", link: true
# FUSE-based file system backed by Amazon S3
brew "s3fs"
# Build tool for Scala projects
brew "sbt"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# netcat on steroids
brew "socat"
# File system client based on SSH File Transfer Protocol
brew "sshfs"
# Version control system designed to be a better CVS
brew "subversion"
# User interface to the TELNET protocol (built from macOS Sierra sources)
brew "telnet"
# Code-search similar to ack
brew "the_silver_searcher"
# Programatically correct mistyped console commands
brew "thefuck"
# Simplified and community-driven man pages
brew "tldr"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Terminal interaction recorder and player
brew "ttyrec"
# Converts a ttyrec file into gif files
brew "ttygif"
# Vi 'workalike' with many additional features
brew "vim"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Internet file retriever
brew "wget"
# JavaScript package manager
brew "yarn"
# UNIX shell (command interpreter)
brew "zsh"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
brew "bbc/cd-utils/wormhole-ecr-credential-helper"
# The fastest shell plugin manager
brew "getantibody/tap/antibody"
# Rocker breaks the limits of Dockerfile.
brew "grammarly/tap/rocker"
# Everything you need to get started with Heroku
brew "heroku/brew/heroku"
# Proxies requests, providing client side certificates
brew "kieran-bamforth/repo/client-cert-proxy"
# Pick a node version from .nvmrc
brew "ouchxp/nodenv/nodenv-nvmrc"
# 
brew "wagoodman/dive/dive"
cask "1password"
cask "1password-cli"
cask "alfred2"
cask "anki"
cask "dash2"
cask "docker"
cask "dropbox"
cask "font-fira-code"
cask "google-chrome"
cask "google-drive-file-stream"
cask "hammerspoon"
cask "imageoptim"
cask "iterm2"
cask "ksdiff"
cask "macvim"
cask "microsoft-office"
cask "mjolnir"
cask "mysqlworkbench"
cask "oni"
cask "phantomjs"
cask "qlcolorcode"
cask "qlimagesize"
cask "qlmarkdown"
cask "quicklook-csv"
cask "quicklook-json"
cask "rowanj-gitx"
cask "slack"
cask "spotify"
cask "suspicious-package"
cask "td-agent"
cask "time-out"
cask "tripmode"
cask "upterm"
cask "vagrant"
cask "virtualbox"
cask "visual-studio-code"
mas "Agenda", id: 1287445660
mas "Microsoft Outlook", id: 985367838
mas "MindNode", id: 1289197285
mas "Things3", id: 904280696
mas "TickTick", id: 966085870
mas "Todoist", id: 585829637
mas "Typist", id: 415166115
mas "Xcode", id: 497799835
