tap "d12frosted/emacs-plus"
tap "grammarly/tap"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "kieran-bamforth/repo"
tap "railwaycat/emacsmacport"

cask "java"
cask "osxfuse"
brew "ant"
brew "openssl"
brew "readline"
brew "python"
brew "asciinema"
brew "autojump"
brew "aws-shell"
brew "awscli"
brew "awslogs"
brew "bash"
brew "bat"
brew "cmake"
brew "coreutils"
brew "ctags"
brew "diff-so-fancy"
brew "fabric"
brew "fasd"
brew "fd"
brew "fontforge"
brew "fswatch"
brew "fzf"
brew "fzy"
brew "gawk"
brew "gnupg"
brew "go-jira"
brew "googler"
brew "gradle"
brew "gron"
brew "htop"
brew "httpie"
brew "hub"
brew "imagemagick"
brew "jenv"
brew "jid"
brew "jq"
brew "lolcat"
brew "makefile2graph"
brew "mas"
brew "maven"
brew "mycli"
brew "neovim"
brew "node"
brew "nodenv"
brew "nvm"
brew "pandoc"
brew "plantuml"
brew "poppler"
brew "prettyping"
brew "pyenv"
brew "pyenv-virtualenv", args: ["HEAD"]
brew "rabbitmq"
brew "rbenv"
brew "reattach-to-user-namespace"
brew "rpm"
brew "ruby"
brew "s3fs"
brew "shellcheck"
brew "sshfs"
brew "subversion"
brew "the_silver_searcher"
brew "thefuck"
brew "tldr"
brew "tmux"
brew "tree"
brew "vim"
brew "wget"
brew "yarn"
brew "zplug"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "d12frosted/emacs-plus/emacs-plus"
brew "grammarly/tap/rocker"
brew "heroku/brew/heroku"
brew "kieran-bamforth/repo/client-cert-proxy"
cask "1password"
cask "1password-cli"
cask "alfred2"
cask "anki"
cask "appzapper"
cask "boom"
cask "crunch"
cask "dash2"
cask "docker"
cask "dropbox"
cask "font-fira-code"
cask "gas-mask"
cask "google-chrome"
cask "google-drive-file-stream"
cask "imageoptim"
cask "iterm2"
cask "ksdiff"
cask "macvim"
cask "microsoft-office"
cask "mjolnir"
cask "mysqlworkbench"
cask "oni"
cask "qlcolorcode"
cask "qlimagesize"
cask "qlmarkdown"
cask "quicklook-csv"
cask "quicklook-json"
cask "rowanj-gitx"
cask "slack"
cask "spotify"
cask "suspicious-package"
cask "td-agent"
cask "time-out"
cask "tripmode"
cask "upterm"
cask "vagrant"
cask "virtualbox"
cask "visual-studio-code"

mas "Things3", id: 904280696
mas "Typist", id: 415166115
