tap "getantibody/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "wagoodman/dive"
tap "wez/wezterm"
brew "antibody"
brew "openssl@1.1"
brew "asciinema"
brew "awscli"
brew "awslogs"
brew "bash"
brew "bat"
brew "bison"
brew "cloc"
brew "cmake"
brew "coreutils"
brew "ctags"
brew "diff-so-fancy"
brew "exa"
brew "fasd"
brew "fd"
brew "fswatch"
brew "fzf"
brew "gh"
brew "git-lfs"
brew "gnupg"
brew "go"
brew "graphicsmagick"
brew "graphviz"
brew "htop"
brew "imagemagick"
brew "jq"
brew "luarocks"
brew "mas"
brew "neovim"
brew "nvm"
brew "pandoc"
brew "plantuml"
brew "pstree"
brew "poppler"
brew "pyenv"
brew "reattach-to-user-namespace"
brew "ripgrep"
brew "shellcheck"
brew "sk"
brew "socat"
brew "telnet"
brew "the_silver_searcher"
brew "thefuck"
brew "tmux", args: ["HEAD"]
brew "tree"
brew "ttyrec"
brew "ttygif"
brew "vim"
brew "watch"
brew "yarn"
cask "1password"
cask "1password-cli"
cask "alfred"
cask "docker"
cask "dropbox"
cask "evernote"
cask "font-fira-code"
cask "gitify"
cask "hammerspoon"
cask "iterm2"
cask "karabiner-elements"
cask "ksdiff"
cask "qlimagesize"
cask "qlmarkdown"
cask "quicklook-csv"
cask "quicklook-json"
cask "spotify"
cask "virtualbox"
cask "visual-studio-code"
cask "wezterm"
mas "1Password 7", id: 1333542190
mas "Reeder", id: 1529448980
mas "Slack", id: 803453959
mas "Todoist", id: 585829637
